#include <stdio.h>
#include "eo_any.h"

//==============================================================================
// Функции обобщенного объекта EoAny
//==============================================================================

//------------------------------------------------------------------------------
// Установка признака объекта
void set_tag(EoAny* obj, Tag tag) {
  obj->head.tag = tag;
}

//------------------------------------------------------------------------------
// Установка указателя на родительский объект
void set_parent(EoAny* child, EoAny* parent) {
  child->head.parent = parent;
}

//------------------------------------------------------------------------------
// Получение признака объекта
Tag get_tag(EoAny* obj) {
  return obj->head.tag;
}

//------------------------------------------------------------------------------
// Получение родителя объекта
EoAny* get_parent(EoAny* obj) {
  return obj->head.parent;
}

// Установка указателя на функцию датаризации
void set_eval(EoAny* obj, int (*eval)(struct EoAny*, struct EoAny*)) {
  obj->head.eval = eval;
}

//------------------------------------------------------------------------------
// Иницилизация головной части любого объекта
void init_head(EoAny* obj, Tag tag, EoAny* parent,
               int (*eval)(struct EoAny*, struct EoAny*)) {
  set_tag(obj, tag);
  set_parent(obj, parent);
  set_eval(obj, eval);
}
